
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ISAWASHUN/aws-ecs-terraform/actions/runs/7027119404)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b3ef89bfa78b0582]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7b762bcf5433586]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00c0ff2d63eb7c1b5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05a4d2914ca9edc60]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d9de1c8bc96a790d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05a9889ad7aa47660]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04644499e1d35015a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f9db97024b495556]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09afe4d2b31cc1a60]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02f39c8c10ab62646]
aws_security_group.ecs: Refreshing state... [id=sg-09e7170c13ba44315]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:targetgroup/go-simple-server-target-group/7f1ffbb450bcb047]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0279be51cdd95b4c7]
aws_security_group.alb: Refreshing state... [id=sg-0aebc2e899f086fe5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f501f908d74e8b94]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0684b2b24e88ad24a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0699329c02acfbf41]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fb0b19157666a587]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-047e343b5a41f48ac]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0685761d5db013174]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db33977869800d9a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f501f908d74e8b941080289494]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2523706584]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:loadbalancer/app/go-simple-server-alb/d39af7559b0cb93f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0df7b7b9e8938f85a]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0972f78fece1f608c]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02f39c8c10ab626461080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09afe4d2b31cc1a601080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:listener/app/go-simple-server-alb/d39af7559b0cb93f/1e4218695e380ce0]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:listener-rule/app/go-simple-server-alb/d39af7559b0cb93f/1e4218695e380ce0/49418536847c9a9a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:547164451157:targetgroup/go-simple-server-target-group/7f1ffbb450bcb047"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-09e7170c13ba44315",
            ]
          + subnets          = [
              + "subnet-05a9889ad7aa47660",
              + "subnet-0d9de1c8bc96a790d",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_iam_role.ecs_task: Creating...
aws_iam_role.ecs: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-simple-server-ecs-20231129021256403000000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:547164451157:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:547164451157:service/go-simple-server/go-simple-server]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"bcaa1aa25f1a41f3f2a77c96335f712099f15c41","Vars":{},"WorkflowName":"Terraform"} -->